module.exports.config = {
  'name': "rules",
  'version': "1.0.0",
  'hasPermssion': 0x0,
  'credits': "𝐈𝐬𝐥𝐚𝐦𝐢𝐜𝐤 𝐂𝐲𝐛𝐞𝐫",
  'description': "important notes",
  'commandCategory': "random-img",
  'usages': "send message",
  'cooldowns': 0x5,
  'dependencies': {
    'request': '',
    'fs-extra': '',
    'axios': ''
  }
};
module.exports.run = async ({
  api: _0x160a93,
  event: _0x4558fa,
  args: _0x1169f8,
  client: _0x248ccf,
  Users: _0x1d6817,
  Threads: _0x35ff0f,
  __GLOBAL: _0x40c419,
  Currencies: _0x4a442e
}) => {
  const _0xde39d5 = global.nodemodule.request;
  const _0x4a7370 = global.nodemodule["fs-extra"];
  var _0x308a72 = ["https://i.imgur.com/NuQMY5X.jpeg"];
  var _0xc03dc2 = () => _0x160a93.sendMessage({
    'body': "⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n•—»✨আসসালামু আলাইকুম🖤💫\n\n•—»✨ এটি একটি ইসলামিক গ্রুপ এবং আমি একটি ইসলামিক রোবোট🤖🕋\n আর এই ইসলামিক গ্রুপ এর কিছু নিয়ম কানুন আছে যা হয় তো বা এই গ্রুপ এর অনেক এর জানা নেই তাই \n আমি নিচে পয়েন্ট আকারে সেই নিয়ম গুলি আপনাদের জানিয়ে দিলাম - আসা করি কেও নিওম বঙ্গ করবেন নাহ - তা না হলে গ্রুপ থেকে বেরিয়ে যেতে পড়েন না হলে - আপনাকে গ্রুপ থেকে বের করে দেওয়া হবে-!!\n\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n\n\n🕋 ｢১｣ যেহেতু এটি একটি ইসলামিক গ্রুপ তো কোনো প্রকার খারাপ ভাষা ব্যবহার করা যাবে নাহ-!!🥺\n\n🕋 ｢২｣ পর্ণ কিংবা বাজে ভিডিও দেওয়া যাবে নাহ \n\n🕋 ｢৩｣ এতো সুন্দর ইসলামিক গ্রুপ এ আছে আল্লাহর সুক্রিয়া করুন - এবং সবাই কে সম্মান দিন \n\n🕋 ｢৪｣ বড় হক কিংবা ছোট কাওকে ছোট করে কথা বলা যাবে নাহ \n\n🕋 ｢৫｣ এখানে ইসলাম এর বাহিরে কোনো কথা বলা যাবে নাহ \n\n🕋 ｢৬｣ ভাই অনেক কষ্ট করে এডমিন গ্রুপ + রোবোট বানিয়েছে তো দয়া করে  এডমিন কে - সম্মান দিবেন \n\n🕋 ｢৭｣ এডমিন খুব ভালো মানুষ আপনার যে কোনো বট এর ফাইল লাগলে তাকে ইনবক্স করবেন \n\n🕋 ｢৮｣ এখানে জগরা করা সম্পুর্ন নিষেধ - কেনো না জগরা করলে শয়তান খুসি হন \n\n🕋 ｢৯｣ এই গ্রুপ এই ইসলামিক রোবোট ছাড়া অন্য কোনো- রোবোট অ্যাড করা যাবে নাহ \n\n🕋 ｢১০｣ ১৮+ নিয়ে আসলে বা ১৮+ পর্ণ নিয়ে কোনো কথা বললে সাথে সাথে গ্রুপ থেকে বের করে দেওয়া হবে \n\n🕋 ｢১১｣ সকল ধর্ম লোক এখানে থাকতে পারবে শুধু মাত্রো - কারো ধর্ম যে নিয়ে কাওকে ছোট করা যাবে নাহ - এটা একটি শিক্ষনিয় বট এর থেকে সবাই আমারা ভালো  শিক্ষা নিতে আসেছি\n\n🕋 ｢১২｣ কেও এক ইমজি বার বার দিবেন নাহ - দয়া করে 🥺\n\n🕋 ｢১৩｣ গ্রুপ এর নাম  গ্রুপ ছোবি কিছু পরিবর্তন করা যাবে নাহ - একমাত্র এডমিন অনুমতি ছাড়া\n\n🕋 ｢১৪｣ গ্রুপে কোন স্পাম মেসেজ করা যাবে নাহ-!!😤\n🕋 ｢১৫｣ গ্রুপ এ কোন প্রোকার ফিসিং লিংক বা নাসা হেগার এর কোন  লিংক দেওয়া যাবেনা\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n\n❤️🌸প্রিয় আমার মুসলিম ভাই | বোন তুমাদের জন্য এতো কষ্ট করে ইসলামক গ্রুপ এবং রোবোট বানিয়েছি আল্লাহে কে ভালো বসলে - এই গ্রুপ ছেরে যেও নাহ 🥺💙 আর গ্রুপ এর নিওম গুলো মেনে চলো \n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n\n৫ ওয়াক্তো নামাজ পরো আল্লাহ কে ডাকো - কেনো নাহ - হাসর এর ময়দানে  | বিচার এর কারবালায় এক মাত্রো আল্লাহ-ই- পারবেন তুমাকে জাহান্নামের সেই ভয়াবহ আগুন থেকে রক্ষা করতে 🥺🤲\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n            ‌\nদোয়া রইলো তুমাদের জন্য প্রিয় গ্রুপ এর মেম্বার রা-!!❤️🤲\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n",
    'attachment': _0x4a7370.createReadStream(__dirname + "/cache/ZiaRein1.jpg")
  }, _0x4558fa.threadID, () => _0x4a7370.unlinkSync(__dirname + "/cache/ZiaRein1.jpg"), _0x4558fa.messageID);
  return _0xde39d5(encodeURI(_0x308a72[Math.floor(Math.random() * _0x308a72.length)])).pipe(_0x4a7370.createWriteStream(__dirname + "/cache/ZiaRein1.jpg")).on("close", () => _0xc03dc2());
};
