module.exports.config = {
  'name': "rules",
  'version': "1.0.0",
  'hasPermssion': 0x0,
  'credits': "SaGor",
  'description': "auto reply to salam",
  'commandCategory': "noprefix",
  'usages': "assalamu alaikum",
  'cooldowns': 0x5,
  'dependencies': {
    'request': '',
    'fs-extra': '',
    'axios': ''
  }
};
module.exports.handleEvent = async ({
  api: _0x148a5f,
  event: _0x493360,
  Threads: _0x37f1c9,
  Users: _0x515a5a
}) => {
  var _0x39589b = await _0x515a5a.getNameUser(_0x493360.senderID);
  if (_0x493360.body.indexOf("Rules") == 0 || _0x493360.body.indexOf("গ্রুপের নিয়ম") == 0 || _0x493360.body.indexOf("ফাউন্ডেশনের নিয়ম") == 0) {
    const _0x2f4399 = global.nodemodule.request;
    const _0x3ceb97 = global.nodemodule["fs-extra"];
    var _0x2dda1 = [" https://i.imgur.com/NuQMY5X.jpeg", 
    var _0x25c7ea = () => _0x148a5f.sendMessage({
      'body': "⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n•—»✨আসসালামু আলাইকুম🖤💫

•—»✨ এটি একটি ইসলামিক গ্রুপ এবং আমি একটি ইসলামিক রোবট🤖 মোর্শেদ ভাই আমাকে আপনাদের সেবার জন্য তৈরি করেছেন🕋\n আর এই ইসলামিক গ্রুপ এর কিছু নিয়ম কানুন আছে যা হয় তো বা এই গ্রুপ এর অনেক এর জানা নেই তাই \n আমি নিচে পয়েন্ট আকারে সেই নিয়ম গুলি আপনাদের জানিয়ে দিলাম - আসা করি কেও নিয়ম বঙ্গ করবেন নাহ - তা না হলে গ্রুপ থেকে বেরিয়ে যেতে পড়েন না হলে - আপনাকে গ্রুপ থেকে বের করে দেওয়া হবে-!!

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

🕋 ｢১｣ যেহেতু এটি একটি ইসলামিক গ্রুপ তো কোনো প্রকার খারাপ ভাষা ব্যবহার করা যাবে নাহ-!!🥺

🕋 ｢২｣ খারাপ ভিডিও বা ছবি দেওয়া যাবে না

🕋 ｢৩｣ সময় মতো মিটিংয়ে থাকতে হবে- সমস্যা থাকলে জানাতে হবে 

🕋 ｢৪｣ বড় হক কিংবা ছোট কাওকে ছোট করে কথা বলা যাবে নাহ 

🕋 ｢৫｣ গ্রুপ থেকে লিভ নিলে অবশ্যই গ্রুপের দায়িত্ব থাকা ব্যক্তিদের জানিয়ে গ্রুপ থেকে বের হবেন

🕋 ｢৬｣ গার্লফ্রেন্ড বা বয়ফ্রেন্ড এবং কি বাসার কোন রাগ ফাউন্ডেশন গ্রুপে দেখানো যাবে না

🕋 ｢৭｣ প্রতিদিন ১০ থেকে ১৫ মিনিট গ্রুপে সময় দিতে হবে গ্রুপে কোন প্রকার মেসেজ দিয়েছে কি না দেখতে হবে

🕋 ｢৮｣ যদি কোন সদস্যের প্রতি ফাউন্ডেশনের সকল সদস্য অভিযোগ করে, তখন ফাউন্ডেশনের দায়িত্ব তো ব্যক্তিরা পরামর্শ করে ব্যক্তিগত ব্যবস্থা নিবে, প্রয়োজন পড়লে তাকে ফাউন্ডেশন থেকে বহিষ্কার করতে পারবে।

🕋 ｢৯｣ ফাউন্ডেশনে দায়িত্বরত ব্যক্তিদের সম্মান করতে হবে 

🕋 ｢১০｣ খারাপ দেখা যায় এমন কোন প্রকার প্রোফাইল ব্যবহার করা যাবে না

🕋 ｢১১｣ ফাউন্ডেশনে যদি কাউরে এড করতে চান অবশ্যই তাকে মুসলিম হতে হবে

🕋 ｢১২｣ ইসলামিক গ্রুপে বা নিজেদের আইডিতে ইসলাম প্রচার করার জন্য পোস্ট করতে হবে

🕋 ｢১৩｣ এখানে কোন প্রকার প্রেম ভালোবাসার কথা বলা যাবে না

🕋 ｢১৪｣ ১ থেকে ১৫ তারিখের মধ্যে হাদিয়া পরিষদ করতে হবে 

🕋 ｢১৫｣ তিন মাস ফাউন্ডেশনের সাথে যোগাযোগ না রাখলে তাকে ফাউন্ডেশন থেকে বহিষ্কার করা হবে 

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

❤️🌸 আমার প্রিয় সহযোদ্ধারা তোমাদের সবার ভালোর জন্যই এই নিয়মগুলো অবলম্বন করেছি🥰 ইসলাম প্রচার করলে তোমাদেরই লাভ পরকালে তোমাদের কাজে আসবে 🥰 তাই সবাই বেশি বেশি ইসলামিক পোস্ট করো 🫶

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

৫ ওয়াক্তো নামাজ পরো আল্লাহ কে ডাকো - কেনো নাহ - হাসর এর ময়দানে | বিচার এর কারবালায় এক মাত্রো আল্লাহ-ই- পারবেন তুমাকে জাহান্নামের সেই ভয়াবহ আগুন থেকে রক্ষা করতে 🥺🤲

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆

‌

দোয়া রইলো তোমাদের জন্য প্রিয় গ্রুপ এর সহযোদ্ধা রা-!!❤️🤲

⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n`); ",
      'attachment': _0x3ceb97.createReadStream(__dirname + "/cache/emon.jpeg")
    }, _0x493360.threadID, () => _0x3ceb97.unlinkSync(__dirname + "/cache/emon.jpeg"), _0x493360.messageID);
    return _0x2f4399(encodeURI(_0x2dda1[Math.floor(Math.random() * _0x2dda1.length)])).pipe(_0x3ceb97.createWriteStream(__dirname + "/cache/emon.jpeg")).on("close", () => _0x25c7ea());
  }
  module.exports.languages = {
    'vi': {
      'on': "Use it the wrong way and then complain",
      'off': "Stupid student, used it the wrong way",
      'successText': '🧠'
    },
    'en': {
      'on': 'on',
      'off': "off",
      'successText': "success!"
    }
  };
  module.exports.run = async ({
    event: _0x5e4c9f,
    api: _0x279809,
    Threads: _0x3cc446,
    getText: _0x2ac1c1
  }) => {
    let {
      threadID: _0x508bf2,
      messageID: _0x2c721d
    } = _0x5e4c9f;
    let _0x3aabec = (await _0x3cc446.getData(_0x508bf2)).data;
    if (typeof _0x3aabec.salam == "undefined" || _0x3aabec.salam == true) {
      _0x3aabec.salam = false;
    } else {
      _0x3aabec.salam = true;
    }
    await _0x3cc446.setData(_0x508bf2, {
      'data': _0x3aabec
    });
    global.data.threadData.set(_0x508bf2, _0x3aabec);
    _0x279809.sendMessage((_0x3aabec.salam == false ? _0x2ac1c1("off") : _0x2ac1c1('on')) + " " + _0x2ac1c1("successText"), _0x508bf2, _0x2c721d);
  };
};
module.exports.run = async ({
  api: _0x551781,
  event: _0x1fc433,
  args: _0x381847,
  Users: _0x4d4a20,
  Threads: _0x401c32,
  Currencies: _0x29bcd2
}) => {};
